Tekla.Structures.Model.ReinforcementExtensions
The Tekla.Structures.Model.ReinforcementExtensions class provides a set of methods to query instances of the Tekla.Structures.Model.Reinforcement and the Tekla.Structures.Model.RebarSplice types.

Tekla.Structures.Model.ReinforcementExtensions.TryGetClosestEdge(Tekla.Structures.Model.RebarSplice,Tekla.Common.Geometry.Vector3,Tekla.Common.Geometry.Segment3@)
Gets the geometric segment of rebarSplice that is closest to the given Tekla.Common.Geometry.Vector3 value.
rebarSplice: The Tekla.Structures.Model.RebarSplice to get the closest segment from.
point: The Tekla.Common.Geometry.Vector3 to get the closest segment to.
closestEdge: The Tekla.Common.Geometry.Segment3 of the given Tekla.Structures.Model.RebarSplice that is closest to point.
Returns: True if rebarSplice defines any segment; otherwise, false.

Tekla.Structures.Model.ReinforcementExtensions.TryGetClosestEdge(Tekla.Structures.Model.Reinforcement,Tekla.Common.Geometry.Vector3,Tekla.Common.Geometry.Segment3@)
Gets the geometric segment of reinforcement that is closest to the given Tekla.Common.Geometry.Vector3 value.
reinforcement: The Tekla.Structures.Model.Reinforcement to get the closest segment from.
point: The Tekla.Common.Geometry.Vector3 to get the closest segment to.
closestEdge: The Tekla.Common.Geometry.Segment3 of the given Tekla.Structures.Model.Reinforcement that is closest to point.
Returns: True if reinforcement defines any segment; otherwise, false.

Tekla.Structures.Model.ReinforcementExtensions.GetRebarGeometryPrimitives(Tekla.Structures.Model.Reinforcement)
Gets all Tekla.BIM.Geometry.PolySegment3 values describing the Tekla.Structures.Model.Reinforcement geometry.
reinforcement: The Tekla.Structures.Model.Reinforcement to get the geometric representation for.
Returns: The collection of Tekla.BIM.Geometry.PolySegment3 values describing the Tekla.Structures.Model.Reinforcement geometry.